package com.firstprj.mahsan.ayinnameapp;

/**
 * Created by Mahsan on 02/28/2017.
 */

public class QuestionLibrary {
    private String mQuestions [] = {
        "در بزرگراه اتومبیل شما دچار نقص فنی میشود برای هشدار به وسائط نقلیه دیگر تابلوی احتیاط را در چه فاصله ای از اتومبیل خود قرار میدهید؟",
        "گواهینامه رانندگی را بنا به در خواست چه کسی باید ارائه داد؟",
        "تنها برای انجام چه مواردی می توانید به رانندگان و عابرین با چراغ بزرگ علامت دهید؟",
        "در میدان ها حق تقدم عبور با کدام وسیله است؟",
            "در گذرگاه پیاده که چراغ راهنمایی و رانندگی نداشته باشد حق تقدم عبور با کیست؟",
            "در برخورد راه اصلی با فرعی حق تقدم عبور با کیست؟",
            "پایین بودن کدام یک از موارد زیر می تواند منجر به حادثه شود؟",
            "در چند متر مانده به تونل ها و پل ها سبقت ممنوع است؟",
            "اگر هنگام رانندگی در سراشیبی کلاج را پایین نگه داریم چه میشود؟",
            "کدام مورد زیر علت تصادف با اتومبیل جلوئی است؟",
            "در چند متر مانده به پیچ ها سبقت ممنوع است؟",
            "در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند وارد خیابان مجاور شوند حق تقدم با کدام است؟",
            "در یک منطقه مسکونی و شهری در حال حرکت هستید، به یک سرعت گیر نزدیک میشوید .چکار میکنید؟",
            "وقتی در خط عبوری که حرکت میکنید اتومبیل ها توقف کرده باشند و راه مسدود شده باشد چه کار باید کرد؟",
            "چه موقع میتوانید به صورت دنده عقب از یک خیابان فرعی به خیابان اصلی وارد شوید؟",
            "موقعی که اتومبیل خود راپارک میکنید، نبایستی ….",
            "چرا نباید مدت زیادی پای خود را روی کلاج نگهدارید؟",
            "حداکثر سرعت در جاده های اصلی برون شهری چند کیلومتر است؟",
            "آیا رانندگان وسایل نقلیه امدادی در هنگام ماموریت مجاز به عبور از محل ممنوع می باشند؟",
            "اگر به هنگام رانندگی متوجه بوی بنزین شدید چه اقدامی میکنید؟",
            "رانندگی در بخش وسط راههایی که به وسیله خط کشی یا علائم دیگر به 3 بخش تقسیم شده به جز چه مواردی ممنوع است؟",
            "پس از روشن شدن موتور برای حرکت ابتدا چه عملی را باید انجام دهیم ؟",
            "در آزاد راه ها میخهای قرمز رنگ چشم گربه ای در چه محلی دیده میشود؟",
            "هنگام پارک کردن در سربالایی که دارای جدول کناری میباشد فرمان را به کدام سمت بچرخانیم؟",
            "کدام یک از گزینه های زیر نقص فنی محسوب نمی شود؟",
            "بعد از چراغ سبز اولین چراغی که روشن میشود کدام است؟",
            "در یک تقاطع در حل رانندگی هستید با چراغ قرمز چشمک زن مواجه میشوید چه کار میکنید؟",
            "خطوطی که در مدخل تقاطع یا در محل معینی از راه ها برای عابر پیاده به آن خطوطه …….. میگویند.",
            "پس از روشن کردن اتومبیل کدام کار راانجام میدهید؟",
            "در صحنه تصادفی جهت کمک توقف کرده اید کدام مورد را انجام میدهید؟",
            "با سرعت مجاز در حال رانندگی هستید اتومبیلی به سرعت از پشت به شما نزدیک می شود و با دادن چراغ از شما راه میخواهد ،چکار باید انجام شود؟",
            "در کدام موقعیت زیر وزش باد شدید می تواند در مسیر شما تاثیر بگذارد؟",
            "کدامیک از نوع آلودگی سهم زیادی از آلودگی ترافیک را تشکیل میدهد ؟",
            "در آزاد راه تنها در چه مواقعی میتوانید در شانه جاده توقف کنید؟",
            "در صورتی که فاصله شما تا اتومبیل جلویی در شب 50 متر باشد باید از ………….",
            "مفهوم رنگ سیاه و سفید در علائم راهنمائی و رانندگی چیست ؟",
            "کدام گزینه های زیر صحیح می باشند ؟",
            "تابلوهایی که به منظور مراکز فرهنگی و تفریحی می باشد با چه رنگ زمینه ای مشخص میگردد؟",
            "برای گردش به چپ دست به چه حالتی باید باشد ؟",
            "تابلوهای به شکل دایره با نوار حاشیه قرمز از کدام دسته تابلوها هستند؟"

    };

    private String mChoices [] [] ={
            {"100","120","150","70"},
            {"پلیس ترافیک","مامور ترافیک","بازرس اتومبیل","پس از وقوع حادثه به فرد دیگر در تصادف"},
            {"جهت اعلام اینکه نه آنها راه داد ه اید","جهت اعلام حضور به آنها"," جهت اعلام اینکه حق تقدم عبور با شماست"," جهت اعلام اینکه دنده عقب می روید"},
            {" وسیله ای اول وارد میشود","وسیله ای که زودتر وارد میدان شده","وسیله ای که در درون میدان در حال حرکت است","هیچکدام"},
            {"وسیله ای که به سمت راست گردش میکند","وسیله ای که مستقیم حرکت میکند","وسیله ای که به چپ گردش میکند","پیادگان"},
            {" وسیله ای که در راه اصلی قرار دارد","وسیله ای که به راست گردش میکند","وسیله ای که مستقیم عبور میکند","هیچکدام"},
            {"سطح ضد یخ"," سطح روغن ترمز","سطح آب باطری","سطح آب خنک کننده رادیاتور"},
            {"100","50","150","70"},
            {"ترمز گرفتن و هدایت اتو مبیل دشوار میشود","لاستیک ها سائیده نمیشود"," اشکالی ندارد","موتور سریع تر کار میکند ، اتومبیل سرعت میگیرد"},
            {"تغییر نور چراغها","عدم توجه کافی به راه و نزدیک شدن بیش از حد به اتومبیل جلوئی","عبور عابر پیاده در مناطق شهری و شلوغ"," ترافیک وسایل نقیله"},
            {"100","50","150","60"},
            {"وسیله ای که به چپ گردش میکند"," وسیله ای که به راست گردش میکند","منتظر میمانند تا پلیس راهنمایی بیاید","هیچکدام"},
            {"با همان سرعت به راه خود ادامه میدهید","با احتیاط سرعت را کاهش میدهید"," از قسمت چپ جاده عبور میکنید"," فرصت ندهید عابرین از خیابان عبور کنند"},
            {"شتاب بگیرید که زودتر از آنها عبور کنید"," به ترافیک جهت مقابل اجازه عبورمی دهید"," به ترافیک مقابل اشاره کنید تا عبور کنند"," به رفتن ادامه میدهید زیرا حق تقدم با شماست"},
            {"در همه مواقع"," تنها اگر هردو خیابان خلوت باشد","تنها اگر خیابان اصلی دارای ترافیک نباشد"," هیچ موقع"},
            {" در جاده اصلی پارک کنید","مانع سایر استفاده کنندگان از را شوید"," در دنده بگذارید","ترمز دستی را بکشید"},
            {" اصطکاک لاستیک ها با جاده کم میشود"," زیرا موجب کم شدن عمر گیر بکس میشود","کنترل شما بر روی وسیله نقلیه کاهش میابد","زیرا مصرف بنزین زیاد میشود"},
            {" روزها 95 کیلومتر ، شب 85 کیلومتر"," روزها 110 کیلومتر ، شب 90 کیلومتر","روزها 90 کیلومتر ، شب 85 کیلومتر","در روزها 80 کیلومتر ؛شب90 کیلومتر"},
            {"به علت خطرات موجود نمی توانند عبور ممنوع بروند","بستگی به شرایط دارد"," در هر شرایطی مجاز هستند","در صورتیکه موجب تصادف نشوند"},
            {"با سرعت کم برانید","توقف کرده و مسئله رابررسی می کنید","هر لحظه باید انتظار داشت بوی بنزین بیاید"," مشکلی نیست و طبیعی است"},
            {"برای سبقت گرفتن یا گردش به چپ","برای دور دوفرمان زدن"," در موارد خاص","هیچکدام"},
            {"آزمایش ترمز","صندلی را تنظیم نمائیم","بستن کمربند"," با پای چپ کلاچ بگیرید"},
            {" در مسیر های ورودی و خروجی و باند های کاهش و افزایش سرعت"," بین شانه خاکی و باند اصلی"," بین هر دو باند مجاز","بین محل خالی و وسط آزاد راه و باند اصلی"},
            {"فرمان را به چپ(در جهت مخالف عقربه های ساعت)"," فرمان را به راست","فرمان را به سمت مقابل صاف میکنیم","فرقی ندارد"},
            {"نداشتن چراغ های جلو وعقب"," کم بودن باد لاستیک ها"," دود کردن","نداشتن زنجیر چرخ در یخبندان"},
            {"قرمز","زرد و قرمز باهم","سبز و زرد باهم","زرد"},
            {"به رفتن ادامه میدهید","ایست کرده و بارعایت حق تقدم عبور میکنید","با احتیاط وسرعت کم میروید","توقف میکنید و منتظر چراغ سبز میشوید"},
            {"طولی","عرضی","ممتد","مقطع"},
            {"گرفتن کلاچ با پای چپ","ابتدا کمربند ایمنی خود میبندید","اولین کار گرفتن ترمز پایی","ترمز دستی را آزاد میکنید"},
            {"افراد زخمی را گرم و در محل راحتی قرار میدهید","فرد زخمی را وادار به راه رفتن میکنید","محل را فورا ترک میکنید","به افراد زخمی نوشیدنی میدهید"},
            {"بر شتاب خود بیافزایید تا اینکه با اتومبیل مذکور فاصله ایمنی را حفظ کنید","اجازه دهید اتومبیل مذکور سبقت بگیرد","آهسته ترمز کنید","سرعت را حفظ کنید و مانع سبقت وسیله مذکور شوید"},
            {"در شهرها","در تونل ها","زمانیکه از مقابل اتومبیل های در حال توقف عبور میکنید","بعد از سبقت گرفتن از یک وسیله نقلیه بزرگ، در مسیر های باز بدون درخت و موانع طبیعی، در بخشی از شهرها که دارای ساختمتن نبوده و در معرض باد قرار دارند."},
            {"آلودگی دیداری","آلودگی هوا","آلودگی شنیداری","آلودگی دیدار ی و آلودگی شنیداری"},
            {"در شرایط اورژانس و اضطراری","اگر قصد سوار کردن افراد کنار جاده را دارید","اگر بطور تصادفی از خروجی مورد نظر رد شده باشید و قصد برگشت داشته باشید","اگر احساس کردید نیاز به استراحت دارید"},
            {"نور بالا استفاده کرد","نور پایین استفاده کرد","چراغها را خاموش کرد","از نور بالا و پائین استفاده کرد"},
            {"حرکات مجاز / راهنمای مسیر و اماکن مذهبی","هشدارهای عمومی و هشدار برای انجام عملیات ساختمانی","علامت دستوری و راهنمای مسیر در سایر راه ها","منع کننده یا ایست"},
            {"سبقت گرفتن در تونل ها با رعایت نکات ایمنی بلامانع است","سبقت گرفتن برای اتوبوس ها در معابر شهری ممنوع نیست","در سر پیچ های تند و سر بالایی ها دور زدن ممنوع است","سبقت از وسیله ای که خود در حال سبقت گرفتن است بلامانع است"},
            {"قهوه ای","نارنجی","زرد","مشکی"},
            {"به صورت عمودی","فقط دست را بیرون آورید","از بالا به پایین حرکت دهید","حالت افقی"},
            {"بازدارنده یا انتظامی","هشدار دهنده یا اخطاری","آگاهی دهنده یا اخباری","هیچکدام"}
    };
    private String mCorrectAnsers[] = { "150",
            "پلیس ترافیک",
            "جهت اعلام حضور به آنها",
            "وسیله ای که در درون میدان در حال حرکت است",
            "پیادگان",
            "وسیله ای که در راه اصلی قرار دارد",
            "سطح روغن ترمز",
            "100",
            " ترمز گرفتن و هدایت اتو مبیل دشوار میشود",
            "عدم توجه کافی به راه و نزدیک شدن بیش از حد به اتومبیل جلوئی",
            "50",
            " وسیله ای که به راست گردش میکند",
            "با احتیاط سرعت را کاهش میدهید",
            "به ترافیک جهت مقابل اجازه عبورمی دهید",
            "هیچ موقع",
            "مانع سایر استفاده کنندگان از را شوید",
            "کنترل شما بر روی وسیله نقلیه کاهش میابد",
            "روزها 95 کیلومتر ، شب 85 کیلومتر",
            "به علت خطرات موجود نمی توانند عبور ممنوع بروند",
            "توقف کرده و مسئله رابررسی می کنید",
            "برای سبقت گرفتن یا گردش به چپ",
            "بستن کمربند",
            "در مسیر های ورودی و خروجی و باند های کاهش و افزایش سرعت",
            "فرمان را به چپ(در جهت مخالف عقربه های ساعت)",
            "کم بودن باد لاستیک ها",
            "زرد",
            "ایست کرده و بارعایت حق تقدم عبور میکنید",
            "عرضی",
            "ابتدا کمربند ایمنی خود میبندید",
            "افراد زخمی را گرم و در محل راحتی قرار میدهید",
            "اجازه دهید اتومبیل مذکور سبقت بگیرد",
            "بعد از سبقت گرفتن از یک وسیله نقلیه بزرگ، در مسیر های باز بدون درخت و موانع طبیعی، در بخشی از شهرها که دارای ساختمتن نبوده و در معرض باد قرار دارند.",
            "آلودگی هوا",
            "در شرایط اورژانس و اضطراری",
            "نور پایین استفاده کرد",
            "علامت دستوری و راهنمای مسیر در سایر راه ها",
            "در سر پیچ های تند و سر بالایی ها دور زدن ممنوع است",
            "قهوه ای",
            "حالت افقی",
            "بازدارنده یا انتظامی",
            "باید فرمان به راست ( موافق جهت عقربه ساعت ) چرخانده شود"
    };

private String mQuestionSessions[]={
        "1",
        "1",
        "1",
        "2",
        "4",
        "1",
        "9",
        "4",
        "10",
        "1",
        "6",
        "5",
        "9",
        "8",
        "7",
        "1",
        "10",
        "3",
        "2",
        "3",
        "2",
        "5",
        "1",
        "2",
        "4",
        "1",
        "9",
        "4",
        "10",
        "7",
        "6",
        "5",
        "9",
        "8",
        "9",
        "2",
        "1",
        "5",
        "6",
        "10"
};

    public String getQuestion(int a){
        String question = mQuestions[a];
        return  question;
    }
    public String getChoice1(int a){
        String choice0 = mChoices[a][0];
        return choice0;
    }
    public String getChoice2(int a){
        String choice1 = mChoices[a][1];
        return choice1;
    }
    public String getChoice3(int a){
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a){
        String choice3 = mChoices[a][3];
        return choice3;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnsers[a];
        return answer;
    }
    public String getQuestionSessions(int a){
        String session = mQuestionSessions[a];
        return session;
    }
}
